# Task 5: Python Data Cleaning using Pandas – Titanic Dataset

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("test.csv")
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.1+ KB

In [4]:
df.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

Age → numeric → fill with median

Embarked → categorical → fill with mode

Cabin → too many nulls → drop column

In [8]:
#Handle missing values

df['Age'].fillna(df['Age'].median(), inplace=True)
df['Fare'].fillna(df['Fare'].median(), inplace=True)

In [11]:
if 'Cabin' in df.columns:
    df.drop(columns=['Cabin'], inplace=True)

In [12]:
#Remove duplicates
before = df.shape[0]
df.drop_duplicates(inplace=True)
after = df.shape[0]

print("Duplicates removed:", before - after)

Duplicates removed: 0

In [13]:
#Datatype conversion

df['Pclass'] = df['Pclass'].astype('category')
df['Sex'] = df['Sex'].astype('category')
df['Embarked'] = df['Embarked'].astype('category')

In [14]:
df['Age_Group'] = pd.cut(
    df['Age'],
    bins=[0, 12, 18, 35, 60, 100],
    labels=['Child', 'Teen', 'Adult', 'Middle-Aged', 'Senior']
)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    category
 2   Name         418 non-null    object
 3   Sex          418 non-null    category
 4   Age          418 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         418 non-null    float64
 9   Embarked     418 non-null    category
 10  Age_Group    418 non-null    category
dtypes: category(4), float64(2), int64(3), object(2)
memory usage: 25.2+ KB

In [16]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Age_Group
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q,Adult
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S,Middle-Aged
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q,Senior
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S,Adult
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S,Adult

In [17]:
df.to_csv("cleaned_titanic_test.csv", index=False)

 ## 1️⃣ Dataset Loading

The dataset was loaded using Pandas to enable efficient data manipulation and analysis. Initial inspection was performed to understand the structure and data types.

 ## 2️⃣ Missing Value Identification

Missing values were identified using built-in Pandas functions to determine which columns required cleaning before further analysis.

## 3️⃣ Handling Missing Numerical Values

Missing values in numerical columns such as Age and Fare were filled using the median to reduce the impact of outliers and maintain data integrity.

## 4️⃣ Column Validation and Removal

Columns with excessive missing data were evaluated for relevance. Defensive checks were used to avoid removing non-existent columns and prevent runtime errors.

## 5️⃣ Duplicate Removal

Duplicate rows were checked and removed to ensure data accuracy and prevent skewed analysis results.

## 6️⃣ Datatype Conversion

Categorical columns were converted to appropriate datatypes to improve memory efficiency and ensure correct analytical behavior.

## 7️⃣ Feature Engineering

A new Age Group column was created to enable grouped analysis and demonstrate data transformation capability.

## 8️⃣ Final Dataset Validation

The dataset was rechecked after cleaning to confirm successful transformations and data consistency.

## 9️⃣ Exporting Cleaned Data

The cleaned dataset was saved as a new CSV file to ensure reusability and maintain separation from raw data.

# INTERVIEW QUESTIONS

# Q1. How do you handle missing values in Pandas?
   First identify them using isnull(), then apply suitable strategies such as median for numerical and mode for categorical data.

# Q2. Difference between fillna() and dropna()?
  fillna() replaces missing values, while dropna() removes rows or columns entirely.

# Q3. How do you detect duplicates?
  Using duplicated() or validating row count before and after drop_duplicates().

# Q4. Why is datatype conversion important?
  It ensures correct calculations, improves performance, and avoids analytical errors.

# Q5. Why Python over Excel for data cleaning?
  Python is scalable, automated, reproducible, and handles large datasets efficiently.